<a href="https://colab.research.google.com/github/kzdanowski/KGN_Programownie1/blob/main/Lab/Zaj%C4%99cia_14_(29_01_26)_grupy_2_i_3_ipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas - podstawy

Podgląd

    df.head()
    df.info()
    df.describe()


Wybór kolumn

    df["Age"]              # Series
    df[["Age", "Sex"]]     # DataFrame


Wybór wierszy

    df.loc[0, "Age"]       # po etykietach
    df.iloc[0, 1]          # po indeksach liczbowych


Filtrowanie

    df[df["Age"] > 30]
    df[(df["Sex"] == "female") & (df["Age"] > 30)]


Series – podstawy

    df["Age"].mean()
    df["Age"].value_counts()
    df["Age"].isna()


Sortowanie

    df.sort_values("Age")


Nowe kolumny

    df["Adult"] = df["Age"] >= 18


Groupby

    df.groupby("Sex")["Survived"].mean()


Braki danych

    df.dropna()
    df["Age"].fillna(df["Age"].mean())


Usuwanie / zmiana nazw

    df.drop(columns=["Cabin"])
    df.rename(columns={"Sex": "gender"})

In [3]:
import pandas as pd

# 1. Tworzymy dane
df = pd.DataFrame({
    'produkt': ['A', 'B', 'C'],
    'cena': [50, 150, 200],
    'ilosc': [10, 2, 1]
})

# 2. Filtrujemy drogie produkty
drogie = df[df['cena'] > 100]

# 3. Liczymy całkowity przychód z tych produktów
suma = (drogie['cena'] * drogie['ilosc']).sum()
print(suma)

500

In [31]:
import pandas as pd

data = {
    'imie': ['Anna', 'Jan'],
    'wiek': [22, 25]
}
df = pd.DataFrame(data)
df.value_counts()

imie  wiek
Anna  22      1
Jan   25      1
Name: count, dtype: int64

In [8]:
import pandas as pd
s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s['a'].item())
print(int(s['b']))

10
20

In [17]:
s = pd.Series([10, 20, 30])
x = s[s >=20]
print(x.mean().item())
print(sum(x))
x

25.0
50

1    20
2    30
dtype: int64

In [57]:
import pandas as pd

url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

df.head(20)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [56]:
df[df['Sex']=='male'].shape[0]

577

## Zadania

Wczytaj dane Titanic do pandas i wyświetl:

    a) pierwsze 5 wierszy
    b) liczbę wierszy i kolumn
    c) listę nazw kolumn.

Sprawdź, ilu pasażerów:

    a) przeżyło, a ilu nie
    b) było kobietami i mężczyznami.
    Wykorzystaj value_counts().

Policz średni wiek pasażerów:

    a) ogólnie
    b) osobno dla kobiet i mężczyzn.
    Użyj mean() oraz groupby().

Wybierz podzbiór danych zawierający tylko:

    – kobiety
    – w wieku powyżej 30 lat
    – podróżujące w 1. klasie.
    Wyświetl kolumny: Age, Sex, Pclass, Survived.

Utwórz nową kolumnę Adult, która ma wartość:

    – True, jeśli wiek ≥ 18
    – False w przeciwnym razie.
    Następnie sprawdź, jaki był odsetek osób dorosłych, które przeżyły.